[{"name":"Unfreedom of the Press","sourceURL":"https://www.amazon.com/Unfreedom-Press-Mark-R-Levin/dp/1476773092/ref=sr_1_1?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-1","listPrice":"28.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81Scw9HLl5L.jpg","https://images-na.ssl-images-amazon.com/images/I/71kNFHuFREL.jpg"],"description":"From five-time #1 New York Times bestselling author, FOX News star, and radio host Mark R. Levin comes a groundbreaking and enlightening book that shows how the great tradition of the American free press has degenerated into a standardless profession that has squandered the faith and trust of the American public, not through actions of government officials, but through its own abandonment of reportorial integrity and objective journalism.Unfreedom of the Press is not just another book about the press. Levin shows how those entrusted with news reporting today are destroying freedom of the press from within: \"not government oppression or suppression,\" he writes, but self-censorship, group-think, bias by omission, and passing off opinion, propaganda, pseudo-events, and outright lies as news. With the depth of historical background for which his books are renowned, Levin takes the reader on a journey through the early American patriot press, which proudly promoted the principles set forth in the Declaration of Independence and the Constitution, followed by the early decades of the Republic during which newspapers around the young country were open and transparent about their fierce allegiance to one political party or the other. It was only at the start of the Progressive Era and the twentieth century that the supposed \"objectivity of the press\" first surfaced, leaving us where we are today: with a partisan party-press overwhelmingly aligned with a political ideology but hypocritically engaged in a massive untruth as to its real nature.Age range:Adult","product_dimensions":"5.5 x 0.9 x 8.4 inches","weight":"13.6 ounces"},{"name":"Educated: A Memoir","sourceURL":"https://www.amazon.com/Educated-Memoir-Tara-Westover/dp/0399590501/ref=sr_1_2?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-2","listPrice":"28.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81WojUxbbFL.jpg"],"description":"#1 NEW YORK TIMES, WALL STREET JOURNAL, AND BOSTON GLOBE BESTSELLER • NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY THE NEW YORK TIMES BOOK REVIEW • ONE OF PRESIDENT BARACK OBAMA'S FAVORITE BOOKS OF THE YEAR • BILL GATES'S HOLIDAY READING LIST • FINALIST FOR THE NATIONAL BOOK CRITICS CIRCLE'S AWARD IN AUTOBIOGRAPHY • FINALIST FOR THE NATIONAL BOOK CRITICS CIRCLE'S JOHN LEONARD PRIZE FOR BEST FIRST BOOK • FINALIST FOR THE PEN/JEAN STEIN BOOK AWARD NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The Washington Post • O: The Oprah Magazine • Time • NPR • Good Morning America • San Francisco Chronicle • The Guardian • The Economist • Financial Times • Newsday • New York Post • theSkimm • Refinery29 • Bloomberg • Self • Real Simple • Town &amp; Country • Bustle • Paste • Publishers Weekly • Library Journal • LibraryReads • BookRiot • Pamela Paul, KQED • New York Public LibraryAn unforgettable memoir about a young girl who, kept out of school, leaves her survivalist family and goes on to earn a PhD from Cambridge UniversityBorn to survivalists in the mountains of Idaho, Tara Westover was seventeen the first time she set foot in a classroom. Her family was so isolated from mainstream society that there was no one to ensure the children received an education, and no one to intervene when one of Tara's older brothers became violent. When another brother got himself into college, Tara decided to try a new kind of life. Her quest for knowledge transformed her, taking her over oceans and across continents, to Harvard and to Cambridge University. Only then would she wonder if she'd traveled too far, if there was still a way home.\"Beautiful and propulsive . . . Despite the singularity of [Tara Westover's] childhood, the questions her book poses are universal: How much of ourselves should we give to those we love? And how much must we betray them to grow up?\"-Vogue\"Westover has somehow managed not only to capture her unsurpassably exceptional upbringing, but to make her current situation seem not so exceptional at all, and resonant for many others.\"-The New York Times Book Review","product_dimensions":"6.4 x 1.1 x 9.5 inches","weight":"1.4 pounds"},{"name":"Howard Stern Comes Again","sourceURL":"https://www.amazon.com/Untitled-Nonfiction-SM-Be-Confirmed/dp/1501194291/ref=sr_1_3?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-3","listPrice":"35.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81DUcqQ2IbL.jpg","https://images-na.ssl-images-amazon.com/images/I/711ZSq8t6hL.jpg"],"description":"Rock stars and rap gods. Comedy legends and A-list actors. Supermodels and centerfolds. Moguls and mobsters. A president.  Over his unrivaled four-decade career in radio, Howard Stern has interviewed thousands of personalities-discussing sex, relationships, money, fame, spirituality, and success with the boldest of bold-faced names. But which interviews are his favorites? It's one of the questions he gets asked most frequently. Howard Stern Comes Again delivers his answer.  This book is a feast of conversation and more, as between the lines Stern offers his definitive autobiography-a magnum opus of confession and personal exploration. Tracy Morgan opens up about his near-fatal car crash. Lady Gaga divulges her history with cocaine. Madonna reminisces on her relationship with Tupac Shakur. Bill Murray waxes philosophical on the purpose of life. Jerry Seinfeld offers a master class on comedy. Harvey Weinstein denies the existence of the so-called casting couch. An impressive array of creative visionaries weigh in on what Stern calls \"the climb\"-the stories of how they struggled and eventually prevailed. As he writes in the introduction, \"If you're having trouble finding motivation in life and you're looking for that extra kick in the ass, you will find it in these pages.\"  Interspersed throughout are rare selections from the Howard Stern Show archives with Donald Trump that depict his own climb: transforming from Manhattan tabloid fixture to reality TV star to president of the United States. Stern also tells of his Moby Dick-like quest to land an interview with Hillary Clinton in the run-up to the 2016 election-one of many newly written revelations from the author. He speaks with extraordinary candor about a variety of subjects, including his overwhelming insecurity early in his career, his revolutionary move from terrestrial radio to SiriusXM, and his belief in the power of psychotherapy.  As Stern insightfully notes in the introduction: \"The interviews collected here represent my best work and show my personal evolution. But they don't just show my evolution. Gathered together like this, they show the evolution of popular culture over the past quarter century.\"","product_dimensions":"7.4 x 1.4 x 9.1 inches","weight":"2.4 pounds"},{"name":"Oh, the Places You'll Go!  ","sourceURL":"https://www.amazon.com/Oh-Places-Youll-Dr-Seuss/dp/0679805273/ref=sr_1_4?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-4","listPrice":"18.99","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81a5KHEkwQL.jpg","https://images-na.ssl-images-amazon.com/images/I/51JZYAB1KFL.jpg","https://images-na.ssl-images-amazon.com/images/I/41E726qVv0L.jpg"],"description":"Dr. Seuss's wonderfully wise Oh, the Places You'll Go! is the perfect send-off for grads-from nursery school, high school, college, and beyond! From soaring to high heights and seeing great sights to being left in a Lurch on a prickle-ly perch, Dr. Seuss addresses life's ups and downs with his trademark humorous verse and illustrations, while encouraging readers to find the success that lies within. In a starred review, Booklist notes, \"Seuss's message is simple but never sappy: life may be a 'Great Balancing Act,' but through it all 'There's fun to be done.'\" A perennial favorite and a perfect gift for anyone starting a new phase in their life!","product_dimensions":"8.4 x 0.4 x 11.3 inches","weight":"12.8 ounces"},{"name":"City of Girls: A Novel","sourceURL":"https://www.amazon.com/City-Girls-Novel-Elizabeth-Gilbert/dp/1594634734/ref=sr_1_5?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-5","listPrice":"28.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/91LDnCtTjEL.jpg"],"description":"AN INSTANT NEW YORK TIMES BESTSELLER!From the # 1 New York Times bestselling author of Eat Pray Love and The Signature of All Things, a delicious novel of glamour, sex, and adventure, about a young woman discovering that you don't have to be a good girl to be a good person.\"A spellbinding novel about love, freedom, and finding your own happiness.\" - PopSugar\"Intimate and richly sensual, razzle-dazzle with a hint of danger.\" -USA Today\"Pairs well with a cocktail...or two.\" -TheSkimm\"Life is both fleeting and dangerous, and there is no point in denying yourself pleasure, or being anything other than what you are.\"Beloved author Elizabeth Gilbert returns to fiction with a unique love story set in the New York City theater world during the 1940s. Told from the perspective of an older woman as she looks back on her youth with both pleasure and regret (but mostly pleasure), City of Girls explores themes of female sexuality and promiscuity, as well as the idiosyncrasies of true love. In 1940, nineteen-year-old Vivian Morris has just been kicked out of Vassar College, owing to her lackluster freshman-year performance. Her affluent parents send her to Manhattan to live with her Aunt Peg, who owns a flamboyant, crumbling midtown theater called the Lily Playhouse. There Vivian is introduced to an entire cosmos of unconventional and charismatic characters, from the fun-chasing showgirls to a sexy male actor, a grand-dame actress, a lady-killer writer, and no-nonsense stage manager. But when Vivian makes a personal mistake that results in professional scandal, it turns her new world upside down in ways that it will take her years to fully understand. Ultimately, though, it leads her to a new understanding of the kind of life she craves - and the kind of freedom it takes to pursue it. It will also lead to the love of her life, a love that stands out from all the rest. Now eighty-nine years old and telling her story at last, Vivian recalls how the events of those years altered the course of her life - and the gusto and autonomy with which she approached it. \"At some point in a woman's life, she just gets tired of being ashamed all the time,\" she muses. \"After that, she is free to become whoever she truly is.\" Written with a powerful wisdom about human desire and connection, City of Girls is a love story like no other.","product_dimensions":"6.3 x 1.5 x 9.3 inches","weight":"1.8 pounds"},{"name":"Where the Crawdads Sing","sourceURL":"https://www.amazon.com/Where-Crawdads-Sing-Delia-Owens/dp/1984827618/ref=sr_1_6?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-6","listPrice":"28.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81trOdoqFVL.jpg"],"description":"#1 New York Times BestsellerA Reese Witherspoon x Hello Sunshine Book Club Pick\"I can't even express how much I love this book! I didn't want this story to end!\"--Reese Witherspoon\"Painfully beautiful.\"--The New York Times Book Review\"Perfect for fans of Barbara Kingsolver.\"--BustleFor years, rumors of the \"Marsh Girl\" have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life--until the unthinkable happens.Perfect for fans of Barbara Kingsolver and Karen Russell, Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.","product_dimensions":"6.1 x 1 x 9.3 inches","weight":"1 pounds"},{"name":"Songs of America: Patriotism, Protest, and the Music That Made a Nation","sourceURL":"https://www.amazon.com/Songs-America-Patriotism-Protest-Nation/dp/0593132955/ref=sr_1_7?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-7","listPrice":"30.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/A1baPh7rFQL.jpg"],"description":"NEW YORK TIMES BESTSELLER • A celebration of American history through the music that helped to shape a nation, by Pulitzer Prize winner Jon Meacham and music superstar Tim McGraw\"Jon Meacham and Tim McGraw form an irresistible duo-connecting us to music as an unsung force in our nation's history.\"-Doris Kearns Goodwin Through all the years of strife and triumph, America has been shaped not just by our elected leaders and our formal politics but also by our music-by the lyrics, performers, and instrumentals that have helped to carry us through the dark days and to celebrate the bright ones.From \"The Star-Spangled Banner\" to \"Born in the U.S.A.,\" Jon Meacham and Tim McGraw take readers on a moving and insightful journey through eras in American history and the songs and performers that inspired us. Meacham chronicles our history, exploring the stories behind the songs, and Tim McGraw reflects on them as an artist and performer. Their perspectives combine to create a unique view of the role music has played in uniting and shaping a nation. Beginning with the battle hymns of the revolution, and taking us through songs from the defining events of the Civil War, the fight for women's suffrage, the two world wars, the Great Depression, the civil rights movement, the Vietnam War, and into the twenty-first century, Meacham and McGraw explore the songs that defined generations, and the cultural and political climates that produced them. Readers will discover the power of music in the lives of figures such as Harriet Tubman, Franklin Roosevelt, Eleanor Roosevelt, and Martin Luther King, Jr., and will learn more about some of our most beloved musicians and performers, including Marian Anderson, Elvis Presley, Sam Cooke, Aretha Franklin, Bob Dylan, Duke Ellington, Carole King, Bruce Springsteen, and more.Songs of America explores both famous songs and lesser-known ones, expanding our understanding of the scope of American music and lending deeper meaning to the historical context of such songs as \"My Country, 'Tis of Thee,\" \"God Bless America,\" \"Over There,\" \"We Shall Overcome,\" and \"Blowin' in the Wind.\" As Quincy Jones says, Meacham and McGraw have \"convened a concert in Songs of America,\" one that reminds us of who we are, where we've been, and what we, at our best, can be.","product_dimensions":"7.8 x 1 x 9.4 inches","weight":"2.4 pounds"},{"name":"Summer of '69","sourceURL":"https://www.amazon.com/Summer-69-Elin-Hilderbrand/dp/0316420018/ref=sr_1_8?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-8","listPrice":"28.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/51UuTYDRqFL.jpg"],"description":"Four siblings experience the drama, intrigue, and upheaval of a summer when everything changed, in New York Times bestselling author Elin Hilderbrand's first historical novel Welcome to the most tumultuous summer of the twentieth century. It's 1969, and for the Levin family, the times they are a-changing. Every year the children have looked forward to spending the summer at their grandmother's historic home in downtown Nantucket. But like so much else in America, nothing is the same: Blair, the oldest sister, is marooned in Boston, pregnant with twins and unable to travel. Middle sister Kirby, caught up in the thrilling vortex of civil rights protests and determined to be independent, takes a summer job on Martha's Vineyard. Only-son Tiger is an infantry soldier, recently deployed to Vietnam. Thirteen-year-old Jessie suddenly feels like an only child, marooned in the house with her out-of-touch grandmother and her worried mother, each of them hiding a troubling secret. As the summer heats up, Ted Kennedy sinks a car in Chappaquiddick, man flies to the moon, and Jessie and her family experience their own dramatic upheavals along with the rest of the country. In her first historical novel, rich with the details of an era that shaped both a nation and an island thirty miles out to sea, Elin Hilderbrand once again earns her title as queen of the summer novel.","product_dimensions":"6.4 x 1.8 x 9.6 inches","weight":"1.4 pounds"},{"name":"Becoming","sourceURL":"https://www.amazon.com/Becoming-Michelle-Obama/dp/1524763136/ref=sr_1_9?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-9","listPrice":"32.50","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81h2gWPTYJL.jpg"],"description":"An intimate, powerful, and inspiring memoir by the former First Lady of the United States  #1 NEW YORK TIMES BESTSELLER • OPRAH'S BOOK CLUB PICK • NAACP IMAGE AWARD WINNER In a life filled with meaning and accomplishment, Michelle Obama has emerged as one of the most iconic and compelling women of our era. As First Lady of the United States of America-the first African American to serve in that role-she helped create the most welcoming and inclusive White House in history, while also establishing herself as a powerful advocate for women and girls in the U.S. and around the world, dramatically changing the ways that families pursue healthier and more active lives, and standing with her husband as he led America through some of its most harrowing moments. Along the way, she showed us a few dance moves, crushed Carpool Karaoke, and raised two down-to-earth daughters under an unforgiving media glare.    In her memoir, a work of deep reflection and mesmerizing storytelling, Michelle Obama invites readers into her world, chronicling the experiences that have shaped her-from her childhood on the South Side of Chicago to her years as an executive balancing the demands of motherhood and work, to her time spent at the world's most famous address. With unerring honesty and lively wit, she describes her triumphs and her disappointments, both public and private, telling her full story as she has lived it-in her own words and on her own terms. Warm, wise, and revelatory, Becoming is the deeply personal reckoning of a woman of soul and substance who has steadily defied expectations-and whose story inspires us to do the same.","product_dimensions":"6.4 x 1.2 x 9.5 inches","weight":"1.7 pounds"},{"name":"The Pioneers: The Heroic Story of the Settlers Who Brought the American Ideal West","sourceURL":"https://www.amazon.com/Pioneers-Heroic-Settlers-Brought-American/dp/1501168681/ref=sr_1_10?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-10","listPrice":"30.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81G-apL1AIL.jpg","https://images-na.ssl-images-amazon.com/images/I/81JBWPXeg9L.jpg"],"description":"#1 NEW YORK TIMES BESTSELLER Pulitzer Prize-winning historian David McCullough rediscovers an important and dramatic chapter in the American story—the settling of the Northwest Territory by dauntless pioneers who overcame incredible hardships to build a community based on ideals that would come to define our country.As part of the Treaty of Paris, in which Great Britain recognized the new United States of America, Britain ceded the land that comprised the immense Northwest Territory, a wilderness empire northwest of the Ohio River containing the future states of Ohio, Indiana, Illinois, Michigan, and Wisconsin. A Massachusetts minister named Manasseh Cutler was instrumental in opening this vast territory to veterans of the Revolutionary War and their families for settlement. Included in the Northwest Ordinance were three remarkable conditions: freedom of religion, free universal education, and most importantly, the prohibition of slavery. In 1788 the first band of pioneers set out from New England for the Northwest Territory under the leadership of Revolutionary War veteran General Rufus Putnam. They settled in what is now Marietta on the banks of the Ohio River. McCullough tells the story through five major characters: Cutler and Putnam; Cutler's son Ephraim; and two other men, one a carpenter turned architect, and the other a physician who became a prominent pioneer in American science. They and their families created a town in a primeval wilderness, while coping with such frontier realities as floods, fires, wolves and bears, no roads or bridges, no guarantees of any sort, all the while negotiating a contentious and sometimes hostile relationship with the native people. Like so many of McCullough's subjects, they let no obstacle deter or defeat them. Drawn in great part from a rare and all-but-unknown collection of diaries and letters by the key figures, The Pioneers is a uniquely American story of people whose ambition and courage led them to remarkable accomplishments. This is a revelatory and quintessentially American story, written with David McCullough's signature narrative energy.","product_dimensions":"9.2 x 6.2 x 9.2 inches","weight":"1.5 pounds"},{"name":"The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life","sourceURL":"https://www.amazon.com/Subtle-Art-Not-Giving-Counterintuitive/dp/0062457713/ref=sr_1_11?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-11","listPrice":"24.99","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/71QKQ9mwV7L.jpg","https://images-na.ssl-images-amazon.com/images/I/51pCXWFd7CL.jpg","https://images-na.ssl-images-amazon.com/images/I/413R2vCAcLL.jpg"],"description":"#1 New York Times BestsellerOver 6 million copies soldIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people.For decades, we've been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let's be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn't sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let's-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up. Manson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek. There are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.","product_dimensions":"21 x 14 x 2.1 inches","weight":"11.4 ounces"},{"name":"The Mueller Report","sourceURL":"https://www.amazon.com/Mueller-Report-Washington-Post/dp/1982129735/ref=sr_1_12?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-12","listPrice":"15.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/71NtuQS4nOL.jpg","https://images-na.ssl-images-amazon.com/images/I/81y4IA3WBAL.jpg"],"description":"The Crucial #1 New York Times Bestseller \"The Mueller report is that rare Washington tell-all that surpasses its pre-publication hype&hellip;the best book by far on the workings of the Trump presidency.\" —Carlos Lozada, The Washington Post The only book with exclusive analysis by the Pulitzer Prize-winning staff of The Washington Post, and the most complete and authoritative available.Read the findings of the Special Counsel's investigation into Russian interference in the 2016 election, complete with accompanying analysis by the Post reporters who've covered the story from the beginning.  This edition from The Washington Post/Scribner contains:  —The long-awaited Report On The Investigation Into Russian Interference In The 2016 Presidential Election  —An introduction by The Washington Post titled \"A President, a Prosecutor, and the Protection of American Democracy\"  —A timeline of the major events of the Special Counsel's investigation from May 2017, when Robert Mueller was appointed, to the report's delivery  —A guide to individuals involved, including in the Special Counsel's Office, the Department of Justice, the FBI, the Trump Campaign, the White House, the Trump legal defense team, and the Russians  —Key documents in the Special Counsel's investigation, including filings pertaining to General Michael T. Flynn, Paul Manafort, Michael Cohen, Roger Stone, and the Russian internet operation in St. Petersburg. Each document is introduced and explained by Washington Post reporters.  One of the most urgent and important investigations ever conducted, the Mueller inquiry focuses on Donald Trump, his presidential campaign, and Russian interference in the 2016 election, and draws on the testimony of dozens of witnesses and the work of some of the country's most seasoned prosecutors.  The special counsel's investigation looms as a turning point in American history. The Mueller Report is essential reading for all citizens concerned about the fate of the presidency and the future of our democracy.","product_dimensions":"6 x 2 x 9 inches","weight":"1.4 pounds"},{"name":"Make Your Bed: Little Things That Can Change Your Life...And Maybe the World","sourceURL":"https://www.amazon.com/Make-Your-Bed-Little-Things/dp/1455570249/ref=sr_1_13?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-13","listPrice":"20.00","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/41nYEMfvoEL.jpg","https://images-na.ssl-images-amazon.com/images/I/71O7GKIgcnL.jpg"],"description":"The inspiring #1 New York Times bestseller that \"should be read by every leader in America.\" (Wall Street Journal)\"Powerful.\" --USA Today \"Full of captivating personal anecdotes from inside the national security vault.\" --Washington Post\"Superb, smart, and succinct.\" --ForbesBASED ON THE INCREDIBLE GRADUATION SPEECH WITH OVER 14 MILLION VIEWS ON YOUTUBEIf you want to change the world, start off by making your bed.On May 17, 2014, Admiral William H. McRaven addressed the graduating class of the University of Texas at Austin on their Commencement day. Taking inspiration from the university's slogan, \"What starts here changes the world,\" he shared the ten principles he learned during Navy Seal training that helped him overcome challenges not only in his training and long Naval career, but also throughout his life; and he explained how anyone can use these basic lessons to change themselves-and the world-for the better.Admiral McRaven's original speech went viral with over 10 million views. Building on the core tenets laid out in his speech, McRaven now recounts tales from his own life and from those of people he encountered during his military service who dealt with hardship and made tough decisions with determination, compassion, honor, and courage. Told with great humility and optimism, this timeless book provides simple wisdom, practical advice, and words of encouragement that will inspire readers to achieve more, even in life's darkest moments.","product_dimensions":"5.4 x 0.8 x 7.4 inches","weight":"7.2 ounces"},{"name":"Stay Sexy & Don't Get Murdered: The Definitive How-To Guide","sourceURL":"https://www.amazon.com/Stay-Sexy-Dont-Murdered-How/dp/1250178959/ref=sr_1_14?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-14","listPrice":"24.99","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/71esf9mEzdL.jpg"],"description":"The highly anticipated first book by Karen Kilgariff and Georgia Hardstark, the voices behind the #1 hit podcast My Favorite Murder!Sharing never-before-heard stories ranging from their struggles with depression, eating disorders, and addiction, Karen and Georgia irreverently recount their biggest mistakes and deepest fears, reflecting on the formative life events that shaped them into two of the most followed voices in the nation.In Stay Sexy & Don’t Get Murdered, Karen and Georgia focus on the importance of self-advocating and valuing personal safety over being ‘nice’ or ‘helpful.’ They delve into their own pasts, true crime stories, and beyond to discuss meaningful cultural and societal issues with fierce empathy and unapologetic frankness.“My Favorite Murder started as a way for Karen Kilgariff and Georgia Hardstark to work through their fears. Now it’s a worldwide community…. Even its darkest moments are lightened by Karen and Georgia's effortlessly funny banter and genuine empathy.” ―RollingStone.comAge Range: Adult","product_dimensions":"9.2 x 6.1 x 9.2 inches","weight":"1.2 pounds"},{"name":"School Zone - Big Preschool Workbook - Ages 3 to 5, Colors, Shapes, Numbers 1-10, Alphabet, Pre-Writing, Pre-Reading, and Phonics (School Zone Big Workbook Series)","sourceURL":"https://www.amazon.com/School-Zone-Preschool-Pre-Writing-Pre-Reading/dp/0887431453/ref=sr_1_15?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-15","listPrice":"12.99","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/81HCcHPXZnL.jpg","https://images-na.ssl-images-amazon.com/images/I/91v59cTAfKL.jpg","https://images-na.ssl-images-amazon.com/images/I/81moXAaKgsL.jpg","https://images-na.ssl-images-amazon.com/images/I/81T3u90DxML.jpg","https://images-na.ssl-images-amazon.com/images/I/711QCT3AGoL.jpg","https://images-na.ssl-images-amazon.com/images/I/81cGu78AppL.jpg"],"description":"Find our complete line of educational resources at Amazon.com/SchoolZonePublishing FEATURES & BENEFITS  320 pages: 319 activity pages, 1 award certificate For ages 3-5 7.75\" x 10.75\" pages with durable glossy cover Book has 5 sections with Parent notes for each: pre-writing skills, alphabet, colors & shapes, following directions, numbers & early math The skill being practiced is listed at the bottom of each page Colorful, kid friendly illustrations reinforce the lessons Easy directions and visual clues promote self-directed learning Concepts and skills build upon one another, progressing from easy to more difficult Perforated pages makes it easy to tear out for individual worksheets The last page of book is an award certificate that is easy to personalize  AMAZING - BIG Preschool Workbook has 300+ colorful exercises that make learning fun! An A+ adventure unfolds, as kids encounter sensational squares and rocking rectangles, a giant newt reading the newspaper and a dinosaur playing the drums. Bold, bright colors and illustrations ease little ones into learning without feeling overwhelmed. Lessons focus on must-know readiness basics, including colors, shapes, the alphabet, basic phonics, early math, and more, and activities appear in order of increasing difficulty, so preschoolers stay challenged until the end, constantly expanding their skills. WORKBOOKS - Help preschoolers get ready for reading, writing, and numbers! This gigantic, Big Preschool Workbook, packed with creative, colorful activities will make learning feel like play. Writing in workbook pages, as opposed to typing on a computer, can help kids to focus and to learn. Writing by hand fires up specific areas of a child's brain, improving a child's ability to not only remember what he or she learns but to think of new ideas. When kids complete the workbook, fill out the Congrats! certificate to reward a job well done. Hang it on the wall or fridge to display their achievement with pride. RESULTS - Our learning materials have helped educate three generations of kids, creating lifelong learners, and the legacy continues. Digital content, flash cards, workbooks, readers, toys, and games—all are crafted through a child's eyes while integrating parent and teacher standards. PREPARATION - Let us help you prepare your young child for the next grade level with our workbooks, flash cards, books and a Little Scholar Tablet. Keep kids \"classroom ready\" with these great supplemental learning tools and more! AWARD WINNING - School Zone content has won The Parents' Choice Foundation Award, Tillywig Toy Awards, Brainchild Award, Family Choice Award, Mom's Choice Awards Honoring Excellence, Gold Star Toy Scholastic Parent and Child Award and many more. School Zone Publishing: Nourishing Young Minds OUR STORY: Almost 40 years ago, long-time educators James Hoffman, Ed.D., and his wife Joan Hoffman, M.A., began a retail supply outlet for teachers, then soon identified a need for at-home learning materials to help parents support and supplement their children's classroom instruction. School Zone Publishing fast emerged as the market leader in workbooks and flash cards for preschoolers through sixth graders. School Zone remains family-owned, focused on excellence, responsive to customers, alert to emerging technology, and committed to community. We continually update our products with new features and content, reflective of changing standards, evolving teaching methods, and overall best practices. As just one example, we update our workbook curriculum on an as-needed basis to address changing standards such as those presented by the National Council of Teachers of Mathematics (NCTM) and Common Core.","product_dimensions":"8.8 x 0.8 x 11 inches","weight":"1.2 pounds"},{"name":"A Game of Thrones / A Clash of Kings / A Storm of Swords / A Feast of Crows / A Dance with Dragons ","sourceURL":"https://www.amazon.com/Thrones-Clash-Kings-Swords-Dragons/dp/0345535529/ref=sr_1_16?fst=as%3Aoff&qid=1561437867&refinements=p_76%3A1250218011&rnid=1250216011&rps=1&s=books&sr=1-16","listPrice":"49.95","imageURLs":["https://images-na.ssl-images-amazon.com/images/I/91HSa7sG8tL.jpg","https://images-na.ssl-images-amazon.com/images/I/81IFSec8vSL.jpg","https://images-na.ssl-images-amazon.com/images/I/919-FLL37TL.jpg","https://images-na.ssl-images-amazon.com/images/I/81-XCtVhX3L.jpg","https://images-na.ssl-images-amazon.com/images/I/81sBQOYFeSL.jpg","https://images-na.ssl-images-amazon.com/images/I/81tE51KeB7L.jpg","https://images-na.ssl-images-amazon.com/images/I/81CD8woZTOL.jpg","https://images-na.ssl-images-amazon.com/images/I/81oaaPQWaRL.jpg"],"description":"Perfect for fans of HBO's Game of Thrones-a boxed set featuring the first five novels!An immersive entertainment experience unlike any other, A Song of Ice and Fire has earned George R. R. Martin-dubbed \"the American Tolkien\" by Time magazine-international acclaim and millions of loyal readers. Now here is the entire monumental cycle:   A GAME OF THRONES A CLASH OF KINGS A STORM OF SWORDS A FEAST FOR CROWS A DANCE WITH DRAGONS   \"One of the best series in the history of fantasy.\"-Los Angeles Times   Winter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King's Landing. There Eddard Stark of Winterfell rules in Robert's name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse-unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season.   Yet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen's brothers Jaime and Tyrion of the powerful and wealthy House Lannister-the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms.   Meanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki-whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys.   \"Long live George Martin . . . a literary dervish, enthralled by complicated characters and vivid language, and bursting with the wild vision of the very best tale tellers.\"-The New York Times","product_dimensions":"4.3 x 8 x 7 inches","weight":"5 pounds"}]